{
  "HeroMenu.Help": [
    "Tips:\n- Click anywhere on the screen to move around.\n- You can also open Hero's menu by pressing the space bar.\n- Close menus by hitting esc key.\n- As you progress, more items will appear in Hero's menu."
  ],
  "CrestfallenHome.CrestfallenMage": [
    "Hope...\nHope is forever lost...",
    {
      "requires": ["homeCave"],
      "msg":
        "The Great Book of ECMAScript has been captured.\nAll I have left is this tattered page..."
    },
    {
      "action": "GiveTatteredPage",
      "cancel": "No thanks",
      "confirm": "OK",
      "msg":
        "It is said that a wizard in the north can release the book.\nIf only I could decipher these runes, I could reach her...\nPerhaps you can try?"
    },
    {
      "next": 2,
      "msg": "No, no that won't do. You'll have to try again."
    },
    {
      "msg":
        "Yes. Yes, that's it! I think you've done it!\nNow, go outside and give it a try."
    },
    "Any luck getting past those stumps?",
    {
      "requires": ["lake"],
      "msg": "I sure hope she’ll be able to help us..."
    },
    {
      "requires": ["greatBook"],
      "msg":
        "You've freed the Great Book!\nOh Hero, a great journey awaits you.\nIt is said the Great book can open many doors.\nGo east!"
    }
  ],
  "Home.JumpHint": ["Hrm...maybe this is a good place to try that jump"],
  "Home.SpellHint": [
    "You've received a spell!\nThere are two ways to cast it:\n1) Open the Hero menu by clicking on the Hero (or pressing space bar), then click the spell's icon.\n2) Press the number key associated with the spell (overlaid on the spell's icon).\n......\nNote: casting spells uses up your magic power."
  ],
  "WitchesHome.Witch": [
    "Hello young man.",
    {
      "cancel": "No thanks",
      "confirm": "I'm seeking the Great Book",
      "msg": "Is there something I can do for you?"
    },
    "Oh dear!!\nIt will come at a high cost...",
    {
      "action": "GiveChargeSpell",
      "cancel": "No thanks",
      "confirm": "Take Spell",
      "msg":
        "I will require the Red Mage's Staff.\nIt is said he lives in the Cave of Fire.\nYou will need to decipher this spell to reach it."
    },
    "Good luck Hero.\nI do hope we meet again...",
    {
      "requires": ["fireCaveEntrance"],
      "msg": "I cannot help you without the Mage's Staff."
    }
  ]
}
